Repository: ammardev99/Qaza_Umari
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Qaza-e-Umri
ur: قضاے عمری

source: All rights reserved
ur: جملہ حقوق محفوظ ہیں

# irfanUlQuran
source: Â© Irfan-ul-Quran - 2023
ur: © عرفان القرآن - 2023

source: Fajar
ur: فجر

source: Zohar
ur: ظہر

source: Asar
ur: عصر

source: Maghrib
ur: مغرب

source: Isha
ur: عشاء

source: Witr
ur: وتر

source: Warning!
ur: انتباہ!

# youDidNotCompleteAllThePrayersToday
source: You didn't complete all the prayers today.
ur: آپ نے آج کی تمام نمازیں مکمل نہیں کیں۔

source: Submit
ur: جمع کریں

source: Learn About Daily Prayer
ur: روزانہ کی نماز کے بارے میں سیکھیں

# tickMarkAgainstThePrayerNameAnd
source: 1- Tick mark against the prayer name and it will be marked as 'Offered'
ur: 1- نماز کے نام کے خلاف ٹک مارک کریں اور اسے 'ادا' کے طور پر نشان زد کیا جائے گا

# ifAnyPrayerIsNotMarkedTick
source: 2- If any prayer is not marked tick, it will be considered as 'Qaza' after certain period of time and will be shown in the 'Regular Qaza Dashboard'
ur: 2- اگر کوئی نماز ٹک نہیں کی گئی تو اسے ایک مقررہ مدت کے بعد 'قضا' سمجھا جائے گا اور اسے 'ریگولر قضا ڈیش بورڈ' میں دکھایا جائے گا

# updateTheRecordOfDailyPrayers
source: 3- Update the record of daily prayers and press the submit button before the date is changed to avoid any wrong calculations
ur: 3- روزانہ کی نمازوں کا ریکارڈ اپ ڈیٹ کریں اور غلط حساب کتاب سے بچنے کے لئے تاریخ تبدیل ہونے سے پہلے 'جمع کریں' بٹن دبائیں

# userMayChangeThePrayerTimeAsPerTheirTimeZone
source: 4- User may change the prayer time as per their time zone by clicking on the 'Clock Icon' or the 'Prayer Time' shown on the daily prayer tab
ur: 4- صارف اپنے ٹائم زون کے مطابق 'گھڑی کے آئیکن' یا روزانہ کی نماز والے ٹیب پر دکھائے گئے 'نماز کے وقت' پر کلک کرکے نماز کا وقت تبدیل کرسکتا ہے

source: Ok
ur: ٹھیک ہے

source: Confirmation
ur: تصدیق

source: Are you sure, you have offered all the prayers today?
ur: کیا آپ نے آج کی تمام نمازیں ادا کیں؟

source: No
ur: نہیں

source: Yes
ur: ہاں

source: Qaza Umri Confirmation
ur: قضاے عمری کی تصدیق

source: Qaza umri left for
ur: قضاے عمری باقی ہے

source: days. Do you want to add?
ur: دن۔ کیا آپ شامل کرنا چاہتے ہیں؟

source: Today
ur: آج

source: Did you offer any prayer in these days?
ur: کیا آپ نے ان دنوں میں کوئی نماز پڑھی؟

source: Stored
ur: محفوظ کیا گیا

source: Calculated!
ur: حساب کیا گیا!

source: Record has been added successfully.
ur: ریکارڈ کامیابی سے شامل کیا گیا ہے۔

# welcomeToQazaEUmri
source: Welcome to the Qaza-e-Umri
ur: قضاے عمری میں خوش آمدید

# trackYourRegularPrayerAndGet
source: Track your regular prayer and get notified at your preferred time before namaz. Very user friendly mobile app.
ur: اپنی باقاعدہ نمازوں کو ٹریک کریں اور نماز سے پہلے اپنے پسندیدہ وقت پر مطلع کریں۔ بہت صارف دوستانہ موبائل ایپ۔

source: Qaza Umri
ur: قضاے عمری

# aVeryUserFriendly
source: A very user friendly and helpful app to keep track of your qasar qaza namaz.
ur: بہت صارف دوستانہ اور مددگار ایپ ہے جس سے اپنی قصر قضا نمازوں کو ٹریک کرنے میں مدد ملتی ہے۔

source: Qasar Qaza
ur: قصر قضا

source: Account Created
ur: اکاؤنٹ بنایا گیا

source: The password provided is too weak.
ur: فراہم کردہ پاس ورڈ بہت کمزور ہے۔

source: The account already exists for that email.
ur: اس ای میل کے لئے اکاؤنٹ پہلے سے موجود ہے۔

source: History
ur: تاریخ

source: Search
ur: تلاش کریں

source: Something went wrong
ur: کچھ غلط ہو گیا

source: No data found
ur: کوئی ڈیٹا نہیں ملا

source: How It Works
ur: یہ کیسے کام کرتا ہے

source: Cannot load url
ur: URL کو لوڈ نہیں کر سکتا

source: Share App
ur: ایپ شیئر کریں

source: Check out the link
ur: لنک چیک کریں

source: Privacy Policies
ur: رازداری کی پالیسیاں

source: Terms Of Use
ur: استعمال کی شرائط

source: Sign Out
ur: سائن آؤٹ

source: Daily Prayer
ur: روزانہ کی نماز

source: Dashboard
ur: ڈیش بورڈ

source: Support
ur: معاونت

source: SKIP
ur: چھوڑ دیں

source: NEXT
ur: اگلا

source: GET STARTED
ur: شروع کریں

source: Regular Qaza
ur: ریگولر قضا

source: Qasar Qaza Record
ur: قصر قضا ریکارڈ

source: Calculator
ur: کیلکولیٹر

source: Qasar Calculator
ur: قصر کیلکولیٹر

source: Enter days travelled:
ur: سفر کے دن درج کریں:

source: Cancel
ur: منسوخ کریں

source: Fill up all the fields correctly.
ur: تمام فیلڈز کو صحیح طریقے سے پُر کریں۔

source: Calculate
ur: حساب کریں

source: Do you want to add qasar namaz?
ur: کیا آپ قصر نماز شامل کرنا چاہتے ہیں؟

# thisWillAddQasarNamazInYourPreviousRecord
source: This will add qasar namaz in your previous record. Do you want to continue?
ur: یہ آپ کے پچھلے ریکارڈ میں قصر نماز شامل کرے گا۔ کیا آپ جاری رکھنا چاہتے ہیں؟

source: Learn About Qasar Qaza
ur: قصر قضا کے بارے میں سیکھیں

# thisIsQasarQazaRecord
source: This is qasar qaza record. Press 'Calculator' button to add qasar qaza namaz. Each time you press 'Calculator' button, new numbers will be added in the previous ones. Press 'Offered' button when you have offered the qasar qaza namaz.
ur: یہ قصر قضا ریکارڈ ہے۔ قصر قضا نماز شامل کرنے کے لئے 'کیلکولیٹر' بٹن دبائیں۔ ہر بار جب آپ 'کیلکولیٹر' بٹن دبائیں گے، نئے نمبر پچھلے نمبروں میں شامل ہو جائیں گے۔ جب آپ نے قصر قضا نماز ادا کی ہو تو 'ادا' بٹن دبائیں۔

source: Qaza Umri Record
ur: قضاے عمری ریکارڈ

source: Umri Calculator
ur: عمری کیلکولیٹر

source: Gender:
ur: جنس:

source: Male
ur: مرد

source: Female
ur: عورت

source: Date of birth:
ur: پیدائش کی تاریخ:

source: Year of puberty:
ur: بلوغت کا سال:

source: Balooghat
ur: بلوغت

# woMenCycleDay
source: Mensturation cycle days:
ur: حیض کے دن:

source: Have any children?
ur: کیا کوئی بچے ہیں؟

source: How many children you have?
ur: آپ کے کتنے بچے ہیں؟

source: Namaz Offered:
ur: پڑھی ہوئی نماز:

source: Learn About Qaza Umri
ur: قضاے عمری کے بارے میں سیکھیں

source: This is qaza umri record:
ur: یہ قضاے عمری ریکارڈ ہے:

# toCalculateYourQazaUmriTillDatePleasePress
source: 1- To calculate your qaza umri till date, please press 'Calculator' button and follow the instructions
ur: 1- اپنے قضاے عمری کا حساب لگانے کے لئے 'کیلکولیٹر' بٹن دبائیں اور ہدایات پر عمل کریں

# ifYouHaveCalculatedAlreadyStartOffering
source: 2- If you have calculated already, start offering your qaza umri and press 'Offered' button for each prayer you have offered. Keep doing the same until all the numbers are zero against each prayer name
ur: 2- اگر آپ نے پہلے سے حساب کیا ہوا ہے تو اپنی قضاے عمری کی نمازیں شروع کریں اور ہر نماز کے لئے 'ادا' بٹن دبائیں جو آپ نے پڑھی ہو۔ یہی عمل جاری رکھیں جب تک کہ ہر نماز کے خلاف تمام نمبر صفر نہ ہو جائیں

# forMoreInformation
source: 3- For more information, please visit 'How it Works' or 'Support'
ur: 3- مزید معلومات کے لئے 'یہ کیسے کام کرتا ہے' یا 'معاونت' ملاحظہ کریں

source: Do you want to recalculate?
ur: کیا آپ دوبارہ حساب کرنا چاہتے ہیں؟

# yourPreviousDataWillBeLostAndTheProcessIsIrrevocable
source: Your previous data will be lost and the process is irrevocable. Do you want to continue?
ur: آپ کا پچھلا ڈیٹا ضائع ہو جائے گا اور یہ عمل ناقابل واپسی ہے۔ کیا آپ جاری رکھنا چاہتے ہیں؟

source: Learn About Umri Calculation
ur: عمری حساب کے بارے میں سیکھیں

source: For Male:
ur: مرد کے لئے:

# pubertyItIsTheAgeWhenYouFirstRealizeThatYouHaveBecomeAnAdult
source: Puberty: It is the age when you first realize that you have become an adult. In males, its natural signal is having Nocturnal Ejaculation/Nightfall/wet dreams/Ehtelaam.
ur: بلوغت: یہ وہ عمر ہے جب آپ نے پہلی بار محسوس کیا کہ آپ بالغ ہو چکے ہیں۔ مردوں میں اس کا قدرتی اشارہ رات کو انزال/رات کے خواب/گھلاؤ ہوتا ہے۔

# thinkDeepToIdentifyTheYearYouBecomeAdultAndPutItInPubertyField
source: Think deep to identify the year you become adult and put it in Puberty field. In males, it is likely to fall between 11 - 15 years.
ur: گہرائی سے سوچیں تاکہ یہ پتہ چل سکے کہ آپ بالغ ہوئے اور اسے بلوغت فیلڈ میں ڈالیں۔ مردوں میں یہ عمر عموماً 11 - 15 سال کے درمیان ہوتی ہے۔

source: In the % offered field, give an estimate of how many prayers you might have offered.
ur: ادا کی گئی فیلڈ میں اس بات کا اندازہ لگائیں کہ آپ نے کتنی نمازیں ادا کی ہو سکتی ہیں۔

source: For Female:
ur: عورت کے لئے:

# pubertyItIsTheAgeInFemalesItsNaturalSignalIsTheFirstMensturationCycle
source: Puberty: It is the age when you first realize that you have become and adult. In females, its natural signal is the first mensturation cycle.
ur: بلوغت: یہ وہ عمر ہے جب آپ نے پہلی بار محسوس کیا کہ آپ بالغ ہو چکی ہیں۔ خواتین میں اس کا قدرتی اشارہ پہلی حیض ہوتی ہے۔

# thinkDeepToInFemalesItIsLikelyToFallBetween
source: Think deep to identify the year you become adult and put it in Puberty field. In females, it is likely to fall between 09 - 14 years.
ur: گہرائی سے سوچیں تاکہ یہ پتہ چل سکے کہ آپ بالغ ہو چکی ہیں اور اسے بلوغت فیلڈ میں ڈالیں۔ خواتین میں یہ عمر عموماً 09 - 14 سال کے درمیان ہوتی ہے۔

# averageMensturationCycleDaysVariesFromDays
source: - Average mensturation cycle days varies from 3-10 days.
ur: - حیض کے اوسط دن 3-10 دن کے درمیان ہوتے ہیں۔

source: - Number of children will help in finding the NIFAS days.
ur: - بچوں کی تعداد نفاس کے دن معلوم کرنے میں مدد کرے گی۔

# weHaveConsideredNIFASPeriodOfDays
source: - We have considered NIFAS period of 40 days.
ur: - ہم نے نفاس کی مدت کو 40 دن مانا ہے۔

# inTheOfferedFieldGive
source: In the % offered field, give an estimate of how many prayers you might have offered.
ur: ادا کی گئی فیلڈ میں اس بات کا اندازہ لگائیں کہ آپ نے کتنی نمازیں ادا کی ہو سکتی ہیں۔

source: Regular Qaza Record
ur: ریگولر قضا ریکارڈ

source: No Qaza Today
ur: آج کوئی قضا نہیں

source: Learn About Regular Qaza
ur: ریگولر قضا کے بارے میں سیکھیں

# thisIsDayToDayQazaRecord
source: This is day-to-day qaza record. Tick mark the namaz if you have offered and it will be removed from the list and marked as 'Offered'
ur: یہ روزمرہ کی قضا کا ریکارڈ ہے۔ اگر آپ نے نماز پڑھی ہو تو نماز کے نام کے خلاف ٹک مارک کریں اور اسے فہرست سے ہٹا دیا جائے گا اور 'ادا' کے طور پر نشان زد کیا جائے گا

source: Support Page
ur: معاونت کا صفحہ

source: IS IT ?
ur: کیا یہ؟

source: Forgot Password
ur: پاس ورڈ بھول گئے

source: Enter Email
ur: ای میل درج کریں

source: Enter Password
ur: پاس ورڈ درج کریں

source: Sign in
ur: سائن ان

source: Enter Name
ur: نام درج کریں

source: Enter Phone
ur: فون درج کریں

source: Sign Up
ur: سائن اپ

# alreayHaveAccount
source: Alreay have account ! Log in
ur: پہلے سے ہی اکاؤنٹ ہے! لاگ ان کریں

source: Monthly Qaza
ur: ماہانہ قضا

source: Total
ur: کل

source: Qaza
ur: قضا

source: The password provided is Wrong.
ur: فراہم کردہ پاس ورڈ غلط ہے۔

source: Register
ur: رجسٹر کریں

source: Continue With Google
ur: گوگل کے ساتھ جاری رکھیں

source: Continue With Facebook
ur: فیس بک کے ساتھ جاری رکھیں

source: Great!
ur: بہت خوب!

source: prayer is done, check dashboard.
ur: نماز ہو گئی ہے، ڈیش بورڈ چیک کریں۔

source: Offered
ur: ادا کیا گیا

source: prayer is done!
ur: نماز ہو گئی!

source: Fajar Prayer Time
ur: فجر کا وقت

source: Zohar Prayer Time
ur: ظہر کا وقت

source: Asar Prayer Time
ur: عصر کا وقت

source: Maghrib Prayer Time
ur: مغرب کا وقت

source: Isha Prayer Time
ur: عشاء کا وقت

source: Prayer done?
ur: نماز ہو گئی
